In [1]:
import pandas as pd

In [2]:
City = ["Los Angeles", "Phoenix", "San Diego", "San Francisco", "Seattle"]
Alaska_On_Time = [497, 221, 212, 503, 1841]
Alaska_Delay = [62, 12, 20, 102, 305]
AM_West_On_Time = [694, 4840, 383, 320, 201]
AM_West_Delay = [117, 415, 65, 129, 61]

In [3]:
FlightsData = list(zip(City, Alaska_On_Time, Alaska_Delay, AM_West_On_Time, AM_West_Delay))
FlightsData

[('Los Angeles', 497, 62, 694, 117),
 ('Phoenix', 221, 12, 4840, 415),
 ('San Diego', 212, 20, 383, 65),
 ('San Francisco', 503, 102, 320, 129),
 ('Seattle', 1841, 305, 201, 61)]

In [4]:
df = pd.DataFrame(data = FlightsData, columns=['City', 'Alaska_On_Time', 'Alaska_Delay', 'AM_West_On_Time', 'AM_West_Delay'])
df

            City  Alaska_On_Time  Alaska_Delay  AM_West_On_Time  AM_West_Delay
0    Los Angeles             497            62              694            117
1        Phoenix             221            12             4840            415
2      San Diego             212            20              383             65
3  San Francisco             503           102              320            129
4        Seattle            1841           305              201             61

In [5]:
df.to_csv('FlightsData.csv', index=False, header=True)

In [6]:
Location = r'C:\Users\garci\OneDrive\Documents\IS 362 Week 3 HW\FlightsData.csv'
Flights = pd.read_csv(Location)

In [7]:
df

            City  Alaska_On_Time  Alaska_Delay  AM_West_On_Time  AM_West_Delay
0    Los Angeles             497            62              694            117
1        Phoenix             221            12             4840            415
2      San Diego             212            20              383             65
3  San Francisco             503           102              320            129
4        Seattle            1841           305              201             61

In [8]:
Flights['Total_Alaska_Flights'] = Flights['Alaska_On_Time'] + Flights['Alaska_Delay']
Flights['Alaska_Percent_Delay'] = (Flights['Alaska_Delay'] / Flights['Total_Alaska_Flights']) * 100
Flights['Alaska_Percent_Delay']

0    11.091234
1     5.150215
2     8.620690
3    16.859504
4    14.212488
Name: Alaska_Percent_Delay, dtype: float64

In [11]:
Flights['Total_AMWest'] = Flights['AM_West_Delay'] + Flights['AM_West_On_Time']

Flights['AMWest_Percent_Delay'] = (Flights['AM_West_Delay'] / Flights['Total_AMWest']) * 100

Flights['AMWest_Percent_Delay']

0    14.426634
1     7.897241
2    14.508929
3    28.730512
4    23.282443
Name: AMWest_Percent_Delay, dtype: float64

In [12]:
Flights[['Alaska_Percent_Delay', 'AMWest_Percent_Delay']]

   Alaska_Percent_Delay  AMWest_Percent_Delay
0             11.091234             14.426634
1              5.150215              7.897241
2              8.620690             14.508929
3             16.859504             28.730512
4             14.212488             23.282443

In [13]:
for index, row in Flights.iterrows():
    if row["Alaska_Percent_Delay"] > row["AMWest_Percent_Delay"]:
        Flights.loc[index, 'Most_Delayed_Airline'] = 'Alaska'
    else: 
        Flights.loc[index, 'Most_Delayed_Airline'] = 'AMWest'
        
Flights['Most_Delayed_Airline']

0    AMWest
1    AMWest
2    AMWest
3    AMWest
4    AMWest
Name: Most_Delayed_Airline, dtype: object

In [14]:
Flights

,City,Alaska_On_Time,Alaska_Delay,AM_West_On_Time,AM_West_Delay,Total_Alaska_Flights,Alaska_Percent_Delay,Total_AMWest,AMWest_Percent_Delay,Most_Delayed_Airline
0,Los Angeles,497,62,694,117,559,11.091234,811,14.426634,AMWest
1,Phoenix,221,12,4840,415,233,5.150215,5255,7.897241,AMWest
2,San Diego,212,20,383,65,232,8.620690,448,14.508929,AMWest
3,San Francisco,503,102,320,129,605,16.859504,449,28.730512,AMWest
4,Seattle,1841,305,201,61,2146,14.212488,262,23.282443,AMWest